Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: جعل الله الكعبة البيت الحرام قياما للناس والشهر الحرام والهدي والقلائد ذلك لتعلموا أن الله يعلم ما في السماوات وما في الأرض وأن الله بكل شيء عليم
en: Allah hath appointed the Ka'bah, the Sacred House, a standard for mankind, and the Sacred Month and the offerings and the garlands. That is so that ye may know that Allah knoweth whatsoever is in the heavens and whatsoever is in the earth, and that Allah is Knower of all things.

source: اعلموا أن الله شديد العقاب وأن الله غفور رحيم
en: Know that Allah is severe in punishment, but that Allah (also) is Forgiving, Merciful.

source: ما على الرسول إلا البلاغ والله يعلم ما تبدون وما تكتمون
en: The duty of the messenger is only to convey (the message). Allah knoweth what ye proclaim and what ye hide.

source: قل لا يستوي الخبيث والطيب ولو أعجبك كثرة الخبيث فاتقوا الله يا أولي الألباب لعلكم تفلحون
en: Say: The evil and the good are not alike even though the plenty of the evil attract thee. So be mindful of your duty to Allah, O men of understanding, that ye may succeed.

source: يا أيها الذين آمنوا لا تسألوا عن أشياء إن تبد لكم تسؤكم وإن تسألوا عنها حين ينزل القرآن تبد لكم عفا الله عنها والله غفور حليم
en: O ye who believe! Ask not of things which, if they were made unto you, would trouble you; but if ye ask of them when the Qur'an is being revealed, they will be made known unto you. Allah pardoneth this, for Allah is Forgiving, Clement.

source: قد سألها قوم من قبلكم ثم أصبحوا بها كافرين
en: A folk before you asked (for such disclosures) and then disbelieved therein.

source: ما جعل الله من بحيرة ولا سائبة ولا وصيلة ولا حام ولكن الذين كفروا يفترون على الله الكذب وأكثرهم لا يعقلون
en: Allah hath not appointed anything in the nature of a Bahirah or a Sa'ibah or a Wasilah or a Hami, but those who disbelieve invent a lie against Allah. Most of them have no sense.

source: وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول قالوا حسبنا ما وجدنا عليه آباءنا أولو كان آباؤهم لا يعلمون شيئا ولا يهتدون
en: And when it is said unto them: Come unto that which Allah hath revealed and unto the messenger, they say: Enough for us is that wherein we found our fathers. What! Even though their fathers had no knowledge whatsoever, and no guidance?

source: يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم إلى الله مرجعكم جميعا فينبئكم بما كنتم تعملون
en: O ye who believe! Ye have charge of your own souls. He who erreth cannot injure you if ye are rightly guided. Unto Allah ye will all return; and then He will inform you of what ye used to do.

source: يا أيها الذين آمنوا شهادة بينكم إذا حضر أحدكم الموت حين الوصية اثنان ذوا عدل منكم أو آخران من غيركم إن أنتم ضربتم في الأرض فأصابتكم مصيبة الموت تحبسونهما من بعد الصلاة فيقسمان بالله إن ارتبتم لا نشتري به ثمنا ولو كان ذا قربى ولا نكتم شهادة الله إنا إذا لمن الآثمين
en: O ye who believe! Let there be witnesses between you when death draweth nigh unto one of you, at the time of bequest - two witnesses, just men from among you, or two others from another tribe, in case ye are campaigning in the land and the calamity of death befall you. Ye shall empanel them both after the prayer, and, if ye doubt, they shall be made to swear by Allah (saying): We will not take a bribe, even though it were (on behalf of) a near kinsman nor will we hide the testimony of Allah, for then indeed we should be of the sinful.

source: فإن عثر على أنهما استحقا إثما فآخران يقومان مقامهما من الذين استحق عليهم الأوليان فيقسمان بالله لشهادتنا أحق من شهادتهما وما اعتدينا إنا إذا لمن الظالمين
en: But then, if it is afterwards ascertained that both of them merit (the suspicion of) sin, let two others take their place of those nearly concerned, and let them swear by Allah, (saying): Verily our testimony is truer than their testimony and we have not transgressed (the bounds of duty), for them indeed we should be of the evil-doers.

source: ذلك أدنى أن يأتوا بالشهادة على وجهها أو يخافوا أن ترد أيمان بعد أيمانهم واتقوا الله واسمعوا والله لا يهدي القوم الفاسقين
en: Thus it is more likely that they will bear true witness or fear that after their oaths the oaths (of others) will be taken. So be mindful of your duty (to Allah) and hearken. Allah guideth not the froward folk.

source: يوم يجمع الله الرسل فيقول ماذا أجبتم قالوا لا علم لنا إنك أنت علام الغيوب
en: In the day when Allah gathereth together the messengers, and saith: What was your response (from mankind)? they say: We have no knowledge. Lo! Thou, only Thou art the Knower of Things Hidden,

source: إذ قال الله يا عيسى ابن مريم اذكر نعمتي عليك وعلى والدتك إذ أيدتك بروح القدس تكلم الناس في المهد وكهلا وإذ علمتك الكتاب والحكمة والتوراة والإنجيل وإذ تخلق من الطين كهيئة الطير بإذني فتنفخ فيها فتكون طيرا بإذني وتبرئ الأكمه والأبرص بإذني وإذ تخرج الموتى بإذني وإذ كففت بني إسرائيل عنك إذ جئتهم بالبينات فقال الذين كفروا منهم إن هذا إلا سحر مبين
en: When Allah saith: O Jesus, son of Mary! Remember My favour unto thee and unto thy mother; how I strengthened thee with the holy Spirit, so that thou spakest unto mankind in the cradle as in maturity; and how I taught thee the Scripture and Wisdom and the Torah and the Gospel; and how thou didst shape of clay as it were the likeness of a bird by My permission, and didst blow upon it and it was a bird by My permission, and thou didst heal him who was born blind and the leper by My permission; and how thou didst raise the dead by My permission; and how I restrained the Children of Israel from (harming) thee when thou camest unto them with clear proofs, and those of them who disbelieved exclaimed: This is naught else than mere magic;

source: وإذ أوحيت إلى الحواريين أن آمنوا بي وبرسولي قالوا آمنا واشهد بأننا مسلمون
en: And when I inspired the disciples, (saying): Believe in Me and in My messenger, they said: We believe. Bear witness that we have surrendered (unto Thee) "we are muslims".

source: إذ قال الحواريون يا عيسى ابن مريم هل يستطيع ربك أن ينزل علينا مائدة من السماء قال اتقوا الله إن كنتم مؤمنين
en: When the disciples said: O Jesus, son of Mary! Is thy Lord able to send down for us a table spread with food from heaven? He said: Observe your duty to Allah, if ye are true believers.

source: قالوا نريد أن نأكل منها وتطمئن قلوبنا ونعلم أن قد صدقتنا ونكون عليها من الشاهدين
en: (They said:) We wish to eat thereof, that we may satisfy our hearts and know that thou hast spoken truth to us, and that thereof we may be witnesses.

source: قال عيسى ابن مريم اللهم ربنا أنزل علينا مائدة من السماء تكون لنا عيدا لأولنا وآخرنا وآية منك وارزقنا وأنت خير الرازقين
en: Jesus, son of Mary, said: O Allah, Lord of us! Send down for us a table spread with food from heaven, that it may be a feast for us, for the first of us and for the last of us, and a sign from Thee. Give us sustenance, for Thou art the Best of Sustainers.

source: قال الله إني منزلها عليكم فمن يكفر بعد منكم فإني أعذبه عذابا لا أعذبه أحدا من العالمين
en: Allah said: Lo! I send it down for you. And whoso disbelieveth of you afterward, him surely will I punish with a punishment wherewith I have not punished any of (My) creatures.

source: وإذ قال الله يا عيسى ابن مريم أأنت قلت للناس اتخذوني وأمي إلهين من دون الله قال سبحانك ما يكون لي أن أقول ما ليس لي بحق إن كنت قلته فقد علمته تعلم ما في نفسي ولا أعلم ما في نفسك إنك أنت علام الغيوب
en: And when Allah saith: O Jesus, son of Mary! Didst thou say unto mankind: Take me and my mother for two gods beside Allah? he saith: Be glorified! It was not mine to utter that to which I had no right. If I used to say it, then Thou knewest it. Thou knowest what is in my mind, and I know not what is in Thy Mind. Lo! Thou, only Thou, art the Knower of Things Hidden?

source: ما قلت لهم إلا ما أمرتني به أن اعبدوا الله ربي وربكم وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شيء شهيد
en: I spake unto them only that which Thou commandedst me, (saying): Worship Allah, my Lord and your Lord. I was a witness of them while I dwelt among them, and when Thou tookest me Thou wast the Watcher over them. Thou art Witness over all things.

source: إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم
en: If Thou punish them, lo! they are Thy slaves, and if Thou forgive them (lo! they are Thy slaves). Lo! Thou, only Thou, art the Mighty, the Wise.

source: قال الله هذا يوم ينفع الصادقين صدقهم لهم جنات تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك الفوز العظيم
en: Allah saith: This is a day in which their truthfulness profiteth the truthful, for theirs are Gardens underneath which rivers flow, wherein they are secure for ever, Allah taking pleasure in them and they in Him. That is the great triumph.

source: لله ملك السماوات والأرض وما فيهن وهو على كل شيء قدير
en: Unto Allah belongeth the Sovereignty of the heavens and the earth and whatsoever is therein, and He is Able to do all things.

source: الحمد لله الذي خلق السماوات والأرض وجعل الظلمات والنور ثم الذين كفروا بربهم يعدلون
en: Praise be to Allah, Who hath created the heavens and the earth, and hath appointed darkness and light. Yet those who disbelieve ascribe rivals unto their Lord.

source: هو الذي خلقكم من طين ثم قضى أجلا وأجل مسمى عنده ثم أنتم تمترون
en: He it is Who hath created you from clay, and hath decreed a term for you. A term is fixed with Him. Yet still ye doubt!

source: وهو الله في السماوات وفي الأرض يعلم سركم وجهركم ويعلم ما تكسبون
en: He is Allah in the heavens and in the earth. He knoweth both your secret and your utterance, and He knoweth what ye earn.

source: وما تأتيهم من آية من آيات ربهم إلا كانوا عنها معرضين
en: Never came there unto them a revelation of the revelations of Allah but they did turn away from it.

source: فقد كذبوا بالحق لما جاءهم فسوف يأتيهم أنباء ما كانوا به يستهزئون
en: And they denied the truth when it came unto them. But there will come unto them the tidings of that which they used to deride.

source: ألم يروا كم أهلكنا من قبلهم من قرن مكناهم في الأرض ما لم نمكن لكم وأرسلنا السماء عليهم مدرارا وجعلنا الأنهار تجري من تحتهم فأهلكناهم بذنوبهم وأنشأنا من بعدهم قرنا آخرين
en: See they not how many a generation We destroyed before them, whom We had established in the earth more firmly than We have established you, and We shed on them abundant showers from the sky, and made the rivers flow beneath them. Yet we destroyed them for their sins, and created after them another generation.

source: ولو نزلنا عليك كتابا في قرطاس فلمسوه بأيديهم لقال الذين كفروا إن هذا إلا سحر مبين
en: Had we sent down unto thee (Muhammad) (actual) writing upon parchment, so that they could feel it with their hands, those who disbelieve would have said: This is naught else than mere magic.

source: وقالوا لولا أنزل عليه ملك ولو أنزلنا ملكا لقضي الأمر ثم لا ينظرون
en: They say: Why hath not an angel been sent down unto him? If We sent down an angel, then the matter would be judged; no further time would be allowed them (for reflection).

source: ولو جعلناه ملكا لجعلناه رجلا وللبسنا عليهم ما يلبسون
en: Had we appointed him (Our messenger) an angel, We assuredly had made him (as) a man (that he might speak to men); and (thus) obscured for them (the truth) they (now) obscure.

source: ولقد استهزئ برسل من قبلك فحاق بالذين سخروا منهم ما كانوا به يستهزئون
en: Messengers (of Allah) have been derided before thee, but that whereat they scoffed surrounded such of them as did deride.

source: قل سيروا في الأرض ثم انظروا كيف كان عاقبة المكذبين
en: Say (unto the disbelievers): Travel in the land, and see the nature of the consequence for the rejecters!

source: قل لمن ما في السماوات والأرض قل لله كتب على نفسه الرحمة ليجمعنكم إلى يوم القيامة لا ريب فيه الذين خسروا أنفسهم فهم لا يؤمنون
en: Say: Unto whom belongeth whatsoever is in the heavens and the earth? Say: Unto Allah. He hath prescribed for Himself mercy, that He may bring you all together to the Day of Resurrection whereof there is no doubt. Those who ruin their souls will not believe.

source: وله ما سكن في الليل والنهار وهو السميع العليم
en: Unto Him belongeth whatsoever resteth in the night and the day. He is the Hearer, the Knower.

source: قل أغير الله أتخذ وليا فاطر السماوات والأرض وهو يطعم ولا يطعم قل إني أمرت أن أكون أول من أسلم ولا تكونن من المشركين
en: Say: Shall I choose for a protecting friend other than Allah, the Originator of the heavens and the earth, Who feedeth and is never fed? Say: I am ordered to be the first to surrender (unto Him). And be not thou (O Muhammad) of the idolaters.

source: قل إني أخاف إن عصيت ربي عذاب يوم عظيم
en: Say: I fear, if I rebel against my Lord, the retribution of an Awful Day.

source: من يصرف عنه يومئذ فقد رحمه وذلك الفوز المبين
en: He from whom (such retribution) is averted on that day, (Allah) hath in truth had mercy on him. That will be the signal triumph.

source: وإن يمسسك الله بضر فلا كاشف له إلا هو وإن يمسسك بخير فهو على كل شيء قدير
en: If Allah touch thee with affliction, there is none that can relieve therefrom save Him, and if He touch thee with good fortune (there is none that can impair it); for He is Able to do all things.

source: وهو القاهر فوق عباده وهو الحكيم الخبير
en: He is the Omnipotent over His slaves, and He is the Wise, the Knower.

source: قل أي شيء أكبر شهادة قل الله شهيد بيني وبينكم وأوحي إلي هذا القرآن لأنذركم به ومن بلغ أئنكم لتشهدون أن مع الله آلهة أخرى قل لا أشهد قل إنما هو إله واحد وإنني بريء مما تشركون
en: Say (O Muhammad): What thing is of most weight in testimony? Say: Allah is Witness between me and you. And this Qur'an hath been inspired in me, that I may warn therewith you and whomsoever it may reach. Do ye in sooth bear witness that there are gods beside Allah? Say: I bear no such witness. Say: He is only One Allah. Lo! I am innocent of that which ye associate (with Him).

source: الذين آتيناهم الكتاب يعرفونه كما يعرفون أبناءهم الذين خسروا أنفسهم فهم لا يؤمنون
en: Those unto whom We gave the Scripture recognise (this revelation) as they recognise their sons. Those who ruin their own souls will not believe.

source: ومن أظلم ممن افترى على الله كذبا أو كذب بآياته إنه لا يفلح الظالمون
en: Who doth greater wrong than he who inventeth a lie against Allah or denieth His revelations? Lo! the wrongdoers will not be successful.

source: ويوم نحشرهم جميعا ثم نقول للذين أشركوا أين شركاؤكم الذين كنتم تزعمون
en: And on the day We gather them together We shall say unto those who ascribed partners (unto Allah): Where are (now) those partners of your make-believe?

source: ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين
en: Then will they have no contention save that they will say: By Allah, our Lord, we never were idolaters.

source: انظر كيف كذبوا على أنفسهم وضل عنهم ما كانوا يفترون
en: See how they lie against themselves, and (how) the thing which they devised hath failed them!

source: ومنهم من يستمع إليك وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإن يروا كل آية لا يؤمنوا بها حتى إذا جاءوك يجادلونك يقول الذين كفروا إن هذا إلا أساطير الأولين
en: Of them are some who listen unto thee, but We have placed upon their hearts veils, lest they should understand, and in their ears a deafness. If they saw every token they would not believe therein; to the point that, when they come unto thee to argue with thee, the disbelievers say: This is naught else than fables of the men of old.

source: وهم ينهون عنه وينأون عنه وإن يهلكون إلا أنفسهم وما يشعرون
en: And they forbid (men) from it and avoid it, and they ruin none save themselves, though they perceive not.

source: ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين
en: If thou couldst see when they are set before the Fire and say: Oh, would that we might return! Then would we not deny the revelations of our Lord but we would be of the believers!

source: بل بدا لهم ما كانوا يخفون من قبل ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون
en: Nay, but that hath become clear unto them which before they used to hide. And if they were sent back they would return unto that which they are forbidden. Lo! they are liars.

source: وقالوا إن هي إلا حياتنا الدنيا وما نحن بمبعوثين
en: And they say: There is naught save our life of the world, and we shall not be raised (again).

source: ولو ترى إذ وقفوا على ربهم قال أليس هذا بالحق قالوا بلى وربنا قال فذوقوا العذاب بما كنتم تكفرون
en: If thou couldst see when they are set before their Lord! He will say: Is not this real? They will say: Yea, verily, by our Lord! He will say: Taste now the retribution for that ye used to disbelieve.

source: قد خسر الذين كذبوا بلقاء الله حتى إذا جاءتهم الساعة بغتة قالوا يا حسرتنا على ما فرطنا فيها وهم يحملون أوزارهم على ظهورهم ألا ساء ما يزرون
en: They indeed are losers who deny their meeting with Allah until, when the Hour cometh on them suddenly, they cry: Alas for us, that we neglected it! They bear upon their backs their burdens. Ah, evil is that which they bear!

source: وما الحياة الدنيا إلا لعب ولهو وللدار الآخرة خير للذين يتقون أفلا تعقلون
en: Naught is the life of the world save a pastime and a sport. Better far is the abode of the Hereafter for those who keep their duty (to Allah). Have ye then no sense?

source: قد نعلم إنه ليحزنك الذي يقولون فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون
en: We know well how their talk grieveth thee, though in truth they deny not thee (Muhammad) but evil-doers flout the revelations of Allah.

source: ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا حتى أتاهم نصرنا ولا مبدل لكلمات الله ولقد جاءك من نبإ المرسلين
en: Messengers indeed have been denied before thee, and they were patient under the denial and the persecution till Our succour reached them. There is none to alter the decisions of Allah. Already there hath reached thee (somewhat) of the tidings of the messengers (We sent before).

source: وإن كان كبر عليك إعراضهم فإن استطعت أن تبتغي نفقا في الأرض أو سلما في السماء فتأتيهم بآية ولو شاء الله لجمعهم على الهدى فلا تكونن من الجاهلين
en: And if their aversion is grievous unto thee, then, if thou canst, seek a way down into the earth or a ladder unto the sky that thou mayst bring unto them a portent (to convince them all)! - If Allah willed, He could have brought them all together to the guidance - So be not thou among the foolish ones.

source: إنما يستجيب الذين يسمعون والموتى يبعثهم الله ثم إليه يرجعون
en: Only those can accept who hear. As for the dead, Allah will raise them up; then unto Him they will be returned.

source: وقالوا لولا نزل عليه آية من ربه قل إن الله قادر على أن ينزل آية ولكن أكثرهم لا يعلمون
en: They say: Why hath no portent been sent down upon him from his Lord? Say: Lo! Allah is Able to send down a portent. But most of them know not.

source: وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم ما فرطنا في الكتاب من شيء ثم إلى ربهم يحشرون
en: There is not an animal in the earth, nor a flying creature flying on two wings, but they are peoples like unto you. We have neglected nothing in the Book (of Our decrees). Then unto their Lord they will be gathered.

source: والذين كذبوا بآياتنا صم وبكم في الظلمات من يشإ الله يضلله ومن يشأ يجعله على صراط مستقيم
en: Those who deny Our revelations are deaf and dumb in darkness. Whom Allah will sendeth astray, and whom He will He placeth on a straight path.

source: قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة أغير الله تدعون إن كنتم صادقين
en: Say: Can ye see yourselves, if the punishment of Allah come upon you or the Hour come upon you, (calling upon other than Allah)? Do ye then call (for help) to any other than Allah? (Answer that) if ye are truthful.

source: بل إياه تدعون فيكشف ما تدعون إليه إن شاء وتنسون ما تشركون
en: Nay, but unto Him ye call, and He removeth that because of which ye call unto Him, if He will, and ye forget whatever partners ye ascribed unto Him.

source: ولقد أرسلنا إلى أمم من قبلك فأخذناهم بالبأساء والضراء لعلهم يتضرعون
en: We have sent already unto peoples that were before thee, and We visited them with tribulation and adversity, in order that they might grow humble.

source: فلولا إذ جاءهم بأسنا تضرعوا ولكن قست قلوبهم وزين لهم الشيطان ما كانوا يعملون
en: If only, when Our disaster came on them, they had been humble! But their hearts were hardened and the devil made all that they used to do seem fair unto them!

source: فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون
en: Then, when they forgot that whereof they had been reminded, We opened unto them the gates of all things till, even as they were rejoicing in that which they were given, We seized them unawares, and lo! they were dumbfounded.

source: فقطع دابر القوم الذين ظلموا والحمد لله رب العالمين
en: So of the people who did wrong the last remnant was cut off. Praise be to Allah, Lord of the Worlds!

source: قل أرأيتم إن أخذ الله سمعكم وأبصاركم وختم على قلوبكم من إله غير الله يأتيكم به انظر كيف نصرف الآيات ثم هم يصدفون
en: Say: Have ye imagined, if Allah should take away your hearing and your sight and seal your hearts, Who is the Allah Who could restore it to you save Allah? See how We display the revelations unto them! Yet still they turn away.

source: قل أرأيتكم إن أتاكم عذاب الله بغتة أو جهرة هل يهلك إلا القوم الظالمون
en: Say: Can ye see yourselves, if the punishment of Allah come upon you unawares or openly? Would any perish save wrongdoing folk?

source: وما نرسل المرسلين إلا مبشرين ومنذرين فمن آمن وأصلح فلا خوف عليهم ولا هم يحزنون
en: We send not the messengers save as bearers of good news and warners. Whoso believeth and doeth right, there shall no fear come upon them neither shall they grieve.

source: والذين كذبوا بآياتنا يمسهم العذاب بما كانوا يفسقون
en: But as for those who deny Our revelations, torment will afflict them for that they used to disobey.

source: قل لا أقول لكم عندي خزائن الله ولا أعلم الغيب ولا أقول لكم إني ملك إن أتبع إلا ما يوحى إلي قل هل يستوي الأعمى والبصير أفلا تتفكرون
en: Say (O Muhammad, to the disbelievers): I say not unto you (that) I possess the treasures of Allah, nor that I have knowledge of the Unseen; and I say not unto you: Lo! I am an angel. I follow only that which is inspired in me. Say: Are the blind man and the seer equal? Will ye not then take thought?

source: وأنذر به الذين يخافون أن يحشروا إلى ربهم ليس لهم من دونه ولي ولا شفيع لعلهم يتقون
en: Warn hereby those who fear (because they know) that they will be gathered unto their Lord, for whom there is no protecting ally nor intercessor beside Him, that they may ward off (evil).

source: ولا تطرد الذين يدعون ربهم بالغداة والعشي يريدون وجهه ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء فتطردهم فتكون من الظالمين
en: Repel not those who call upon their Lord at morn and evening, seeking His Countenance. Thou art not accountable for them in aught, nor are they accountable for thee in aught, that thou shouldst repel them and be of the wrong-doers.

source: وكذلك فتنا بعضهم ببعض ليقولوا أهؤلاء من الله عليهم من بيننا أليس الله بأعلم بالشاكرين
en: And even so do We try some of them by others, that they say: Are these they whom Allah favoureth among us? Is not Allah best Aware of the thanksgivers?

source: وإذا جاءك الذين يؤمنون بآياتنا فقل سلام عليكم كتب ربكم على نفسه الرحمة أنه من عمل منكم سوءا بجهالة ثم تاب من بعده وأصلح فأنه غفور رحيم
en: And when those who believe in Our revelations come unto thee, say: Peace be unto you! Your Lord hath prescribed for Himself mercy, that whoso of you doeth evil through ignorance and repenteth afterward thereof and doeth right, (for him) lo! He is Forgiving, Merciful.

source: وكذلك نفصل الآيات ولتستبين سبيل المجرمين
en: Thus do We expound the revelations that the way of the unrighteous may be manifest.

source: قل إني نهيت أن أعبد الذين تدعون من دون الله قل لا أتبع أهواءكم قد ضللت إذا وما أنا من المهتدين
en: Say: I am forbidden to worship those on whom ye call instead of Allah. Say: I will not follow your desires, for then should I go astray and I should not be of the rightly guided.
